src/cloud/aws/aws.org
#+hugo_base_dir: ~/projects/blog/lijwxg

---
title: AWS的使用
date: 2020-08-13
tags:
  - aws
  - cloud
  - ecr
  - sagemaker
  - ec2
  - s3
---
* AWS                                                                   :aws:
** DONE AWS基础                                    :aws:ec2:s3:ecr:sagemaker:
   CLOSED: [2020-08-13 Sun 18:11]
   :properties:
   :export_file_name: aws-start
   :end:

 [[https://console.aws.amazon.com/][亚马逊云]]是十分领先的云服务厂商, 提供了大量开箱即用服务.大大减少了开发成本.
 #+hugo: more
*** 使用亚马逊的云服务
**** EC2

 Elastic Compute Cloud  
 服务器

**** S3

 Simple Storage Service  
 存储

**** ECR

 Elastic Container Registry  
 容器注册表

**** Lambda

 Serverless, 函数

**** SageMaker

 大规模构建、训练和部署机器学习模型

*** aws工具集

**** 安装awscli

 #+begin_src shell
 mkvirtualenv aws
 workon aws
 pip install awscli
 #+end_src

**** 配置系统环境

 从我的安全凭证中获取到access key id, secret access key
 #+begin_src shell
 aws configure
 #+end_src

**** 授权ec2访问s3

 在我的安全凭证中创建角色, 给EC2服务增加S3的权限
 #+begin_src shell
 aws s3 ls
 aws s3 cp s3://lijwxg/demo .
 #+end_src

**** 使用ecr

 登陆
 #+begin_src shell
 aws ecr get-login --no-include-email|sh
 #+end_src

 推送本地镜像到ecr
 #+begin_src shell
 docker images
 docker tag 338f12981185 111111111.dkr.ecr.ap-northeast-1.amazonaws.com/demo
 docker push 111111111.dkr.ecr.ap-northeast-1.amazonaws.com/demo
 #+end_src
